artillery.yml
config:
  target: 'http://localhost:3000'
  phases: 
    - duration: 60
      arrivalRate: 20
scenarios:
  - name: "createRecipe"
    flow:
    - post:
        url: "/recipes"        
        json: 
          title: "Testing a recipe"
          description: "Testing a recipe"
          completed: false

  - name: "showAllUsers"
    flow:
    - get:
        url: "/users"     
        json: 
          title: "Testing Users"
          description: "Testing a User"
          completed: false